open-vela/vendor_gigadevice/boards/gd32f4/gd32f470i_eval/src/gd32f4xx_dci_ov2640.c
/****************************************************************************
 * vendor/gigadevice/boards/gd32f4/gd32f470i_eval/src/gd32f4xx_dci_ov2640.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdbool.h>
#include <stdio.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/i2c/i2c_master.h>
#include <nuttx/video/imgdata.h>
#include <nuttx/video/imgsensor.h>
#include <nuttx/video/v4l2_cap.h>
#include <nuttx/video/video.h>

#include <arch/board/board.h>

#include "gd32f4xx_ov2640_init_table.h"

#include "gd32f4xx.h"
#include "gd32f4xx_dci.h"
#include "gd32f470i_eval.h"

#include "hardware/gd32f4xx_i2c.h"

#ifdef CONFIG_GD32F4_DCI

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_OV2640_FREQUENCY
#  define CONFIG_OV2640_FREQUENCY 100000
#endif

#define GD32_OV2640_NENTRIES(a)   (sizeof(a) / sizeof((a)[0]))

#define GD32_OV2640_REG_BANK_SEL  0xff
#define GD32_OV2640_REG_RESET     0x12
#define GD32_OV2640_REG_OUTW      0x5a
#define GD32_OV2640_REG_OUTH      0x5b
#define GD32_OV2640_REG_OUTSIZE   0x5c
#define GD32_OV2640_REG_CTRL0     0xe0

#define GD32_OV2640_MIDH_EXPECTED  0x7f
#define GD32_OV2640_MIDL_EXPECTED  0xa2
#define GD32_OV2640_PID_EXPECTED   0x26
#define GD32_OV2640_VER_EXPECTED   0x42

#define GD32_OV2640_SIZE_WIDTH    320
#define GD32_OV2640_SIZE_HEIGHT   240

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct ov2640_sensor_s
{
  struct imgsensor_s sensor;
  FAR struct i2c_master_s *i2c;
  bool initialized;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static bool ov2640_is_available(FAR struct imgsensor_s *sensor);
static int  ov2640_sensor_init(FAR struct imgsensor_s *sensor);
static int  ov2640_sensor_uninit(FAR struct imgsensor_s *sensor);
static const char *ov2640_get_driver_name(FAR struct imgsensor_s *sensor);
static int  ov2640_validate_frame_setting(FAR struct imgsensor_s *sensor,
              imgsensor_stream_type_t type,
              uint8_t nr_datafmts,
              FAR imgsensor_format_t *datafmts,
              FAR imgsensor_interval_t *interval);
static int  ov2640_start_capture(FAR struct imgsensor_s *sensor,
              imgsensor_stream_type_t type,
              uint8_t nr_datafmts,
              FAR imgsensor_format_t *datafmts,
              FAR imgsensor_interval_t *interval);
static int  ov2640_stop_capture(FAR struct imgsensor_s *sensor,
              imgsensor_stream_type_t type);
static int  gd32_ov2640_initialize(FAR struct ov2640_sensor_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct v4l2_fmtdesc g_ov2640_fmtdescs[] =
{
  {
    .index       = 0,
    .type        = V4L2_BUF_TYPE_VIDEO_CAPTURE,
    .flags       = 0,
    .description = "YUYV 4:2:2",
    .pixelformat = V4L2_PIX_FMT_YUYV,
  },
  {
    .index       = 1,
    .type        = V4L2_BUF_TYPE_VIDEO_CAPTURE,
    .flags       = V4L2_FMT_FLAG_COMPRESSED,
    .description = "JPEG",
    .pixelformat = V4L2_PIX_FMT_JPEG,
  },
  {
    .index       = 2,
    .type        = V4L2_BUF_TYPE_VIDEO_CAPTURE,
    .flags       = 0,
    .description = "RGB565",
    .pixelformat = V4L2_PIX_FMT_RGB565,
  },
};

static const struct v4l2_frmsizeenum g_ov2640_frmsizes[] =
{
  {
    .index        = 0,
    .type         = V4L2_FRMSIZE_TYPE_DISCRETE,
    .discrete     =
      {
        .width  = 160,
        .height = 120
      },  /* QQVGA */
  },
  {
    .index        = 1,
    .type         = V4L2_FRMSIZE_TYPE_DISCRETE,
    .discrete     =
      {
        .width  = 320,
        .height = 240
      },  /* QVGA */
  },
  {
    .index        = 2,
    .type         = V4L2_FRMSIZE_TYPE_DISCRETE,
    .discrete     =
      {
        .width  = 640,
        .height = 480
      },  /* VGA */
  },
  {
    .index        = 3,
    .type         = V4L2_FRMSIZE_TYPE_DISCRETE,
    .discrete     =
      {
        .width  = 800,
        .height = 600
      },  /* SVGA */
  },
  {
    .index        = 4,
    .type         = V4L2_FRMSIZE_TYPE_DISCRETE,
    .discrete     =
      {
        .width  = 1024,
        .height = 768
      },  /* XGA */
  },
  {
    .index        = 5,
    .type         = V4L2_FRMSIZE_TYPE_DISCRETE,
    .discrete     =
      {
        .width  = 1280,
        .height = 1024
      }, /* SXGA */
  },
  {
    .index        = 6,
    .type         = V4L2_FRMSIZE_TYPE_DISCRETE,
    .discrete     =
      {
        .width  = 1600,
        .height = 1200
      }, /* UXGA */
  },
};

static const struct imgsensor_ops_s g_ov2640_sensor_ops =
{
  .is_available           = ov2640_is_available,
  .init                   = ov2640_sensor_init,
  .uninit                 = ov2640_sensor_uninit,
  .get_driver_name        = ov2640_get_driver_name,
  .validate_frame_setting = ov2640_validate_frame_setting,
  .start_capture          = ov2640_start_capture,
  .stop_capture           = ov2640_stop_capture,
  .get_frame_interval     = NULL,
  .get_supported_value    = NULL,
  .get_value              = NULL,
  .set_value              = NULL,
};

