open-vela/vendor_gigadevice/boards/gd32f4/gd32f470i_eval/src/gd32f4xx_dci_ov2640.c
static struct ov2640_sensor_s g_ov2640_priv;

#define OV2640_FMTDESCS_NUM  (sizeof(g_ov2640_fmtdescs) / \
                              sizeof(g_ov2640_fmtdescs[0]))
#define OV2640_FRMSIZES_NUM  (sizeof(g_ov2640_frmsizes) / \
                              sizeof(g_ov2640_frmsizes[0]))

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ov2640_is_available
 ****************************************************************************/

static bool ov2640_is_available(FAR struct imgsensor_s *sensor)
{
  return true;
}

/****************************************************************************
 * Name: ov2640_sensor_init
 ****************************************************************************/

static int ov2640_sensor_init(FAR struct imgsensor_s *sensor)
{
  FAR struct ov2640_sensor_s *priv =
    (FAR struct ov2640_sensor_s *)sensor;

  return gd32_ov2640_initialize(priv);
}

/****************************************************************************
 * Name: ov2640_sensor_uninit
 ****************************************************************************/

static int ov2640_sensor_uninit(FAR struct imgsensor_s *sensor)
{
  FAR struct ov2640_sensor_s *priv =
    (FAR struct ov2640_sensor_s *)sensor;

  priv->initialized = false;
  return OK;
}

/****************************************************************************
 * Name: ov2640_get_driver_name
 ****************************************************************************/

static const char *ov2640_get_driver_name(FAR struct imgsensor_s *sensor)
{
  return "OV2640";
}

/****************************************************************************
 * Name: ov2640_validate_frame_setting
 ****************************************************************************/

static int ov2640_validate_frame_setting(FAR struct imgsensor_s *sensor,
                                         imgsensor_stream_type_t type,
                                         uint8_t nr_datafmts,
                                         FAR imgsensor_format_t *datafmts,
                                         FAR imgsensor_interval_t *interval)
{
  /* Accept all valid formats - actual validation done by imgdata side */

  return OK;
}

/****************************************************************************
 * Name: ov2640_start_capture
 ****************************************************************************/

static int ov2640_start_capture(FAR struct imgsensor_s *sensor,
                                imgsensor_stream_type_t type,
                                uint8_t nr_datafmts,
                                FAR imgsensor_format_t *datafmts,
                                FAR imgsensor_interval_t *interval)
{
  /* OV2640 is always streaming after initialization.
   * The DCI hardware controls capture start/stop.
   */

  return OK;
}

/****************************************************************************
 * Name: ov2640_stop_capture
 ****************************************************************************/

static int ov2640_stop_capture(FAR struct imgsensor_s *sensor,
                               imgsensor_stream_type_t type)
{
  return OK;
}

/****************************************************************************
 * SCCB (Serial Camera Control Bus) low-level implementation
 *
 * The OV2640 uses SCCB protocol which differs from standard I2C:
 *   - Write: START + SlaveAddr(W) + RegAddr + Data + STOP
 *   - Read:  START + SlaveAddr(W) + RegAddr + STOP +
 *            START + SlaveAddr(R) + Data + NACK + STOP
 *
 * The NuttX I2C framework cannot properly generate this sequence on the
 * GD32F4 I2C peripheral. We therefore directly access the I2C0 registers
 * following the exact same procedure as the vendor sccb.c reference.
 ****************************************************************************/

#define SCCB_I2C_BASE         GD32_I2C0
#define SCCB_WRITE_ADDR       (BOARD_OV2640_I2C_ADDR << 1)        /* 0x60 */
#define SCCB_READ_ADDR        ((BOARD_OV2640_I2C_ADDR << 1) | 1)  /* 0x61 */
#define SCCB_TIMEOUT          2000000

static inline uint16_t sccb_getreg(uint8_t offset)
{
  return getreg16(SCCB_I2C_BASE + offset);
}

static inline void sccb_putreg(uint8_t offset, uint16_t value)
{
  putreg16(value, SCCB_I2C_BASE + offset);
}

static inline void sccb_modifyreg(uint8_t offset,
                                  uint16_t clearbits, uint16_t setbits)
{
  modifyreg16(SCCB_I2C_BASE + offset, clearbits, setbits);
}

/****************************************************************************
 * Name: gd32_ov2640_putreg
 *
 * Description:
 *   Write one byte to an OV2640 register via SCCB.
 *   Protocol: S + 0x60 + reg + data + P
 ****************************************************************************/

static int gd32_ov2640_putreg(FAR struct i2c_master_s *i2c,
                              uint8_t regaddr, uint8_t regval)
{
  volatile uint32_t timeout;

  (void)i2c; /* We bypass the NuttX I2C framework */

  /* Wait until I2C bus is idle */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT1_OFFSET) & (1 << 1)) != 0)  /* BUSY */
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB WR: BUSY timeout reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Generate START */

  sccb_modifyreg(GD32_I2C_CTL0_OFFSET, 0, I2C_CTL0_START);

  /* Wait for SBSEND (Start Bit Sent) */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_SBSEND) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB WR: SBSEND timeout reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Send slave write address */

  sccb_putreg(GD32_I2C_DATA_OFFSET, SCCB_WRITE_ADDR);

  /* Wait for ADDSEND (Address Sent + ACK) */

