open-vela/vendor_gigadevice/boards/gd32f4/gd32f470i_eval/src/gd32f4xx_dci_ov2640.c
  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_ADDSEND) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB WR: ADDSEND timeout reg=0x%02x "
                 "STAT0=0x%04x\n", regaddr,
                 sccb_getreg(GD32_I2C_STAT0_OFFSET));
          return -ETIMEDOUT;
        }
    }

  /* Clear ADDSEND by reading STAT0 then STAT1 */

  (void)sccb_getreg(GD32_I2C_STAT0_OFFSET);
  (void)sccb_getreg(GD32_I2C_STAT1_OFFSET);

  /* Wait for transmit buffer empty */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_TBE) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB WR: transmit buffer empty timeout"
                 " reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Send register address */

  sccb_putreg(GD32_I2C_DATA_OFFSET, regaddr);

  /* Wait for BTC (Byte Transfer Complete) */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_BTC) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB WR: byte transfer complete timeout"
                 " reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Send register value */

  sccb_putreg(GD32_I2C_DATA_OFFSET, regval);

  /* Wait for transmit buffer empty */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_TBE) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB WR: transmit buffer empty timeout"
                 " reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Generate STOP */

  sccb_modifyreg(GD32_I2C_CTL0_OFFSET, 0, I2C_CTL0_STOP);

  return OK;
}

/****************************************************************************
 * Name: gd32_ov2640_getreg
 *
 * Description:
 *   Read one byte from an OV2640 register via SCCB.
 *   Protocol: S + 0x60 + reg + P  then  S + 0x61 + [data] + NAK + P
 ****************************************************************************/

static int gd32_ov2640_getreg(FAR struct i2c_master_s *i2c,
                              uint8_t regaddr, FAR uint8_t *regval)
{
  volatile int wait_i;
  volatile uint32_t timeout;

  (void)i2c; /* We bypass the NuttX I2C framework */

  /* ---- Phase 1: Write register address (slave addr = 0x60) ---- */

  /* Clear AF (Acknowledge Failure) flag if set from previous transaction */

  sccb_putreg(GD32_I2C_STAT0_OFFSET,
              sccb_getreg(GD32_I2C_STAT0_OFFSET) | (1 << 10));

  /* Wait for bus idle before starting */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT1_OFFSET) & (1 << 1)) != 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB RD: BUSY timeout reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Generate START */

  sccb_modifyreg(GD32_I2C_CTL0_OFFSET, 0, I2C_CTL0_START);

  /* Wait for SBSEND */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_SBSEND) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB RD: SBSEND1 timeout reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Send slave write address (0x60) */

  sccb_putreg(GD32_I2C_DATA_OFFSET, SCCB_WRITE_ADDR);

  /* Wait for ADDSEND */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_ADDSEND) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB RD: ADDSEND1 timeout reg=0x%02x "
                 "STAT0=0x%04x\n", regaddr,
                 sccb_getreg(GD32_I2C_STAT0_OFFSET));
          return -ETIMEDOUT;
        }
    }

  /* Clear ADDSEND */

  (void)sccb_getreg(GD32_I2C_STAT0_OFFSET);
  (void)sccb_getreg(GD32_I2C_STAT1_OFFSET);

  /* Wait for Transmit buffer empty timeout */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_TBE) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB RD: transmit buffer empty timeout"
                 " reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Send register address */

  sccb_putreg(GD32_I2C_DATA_OFFSET, regaddr);

  /* Wait for BTC */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_BTC) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB RD: BTC timeout reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Clear AF flag */

  sccb_putreg(GD32_I2C_STAT0_OFFSET,
              sccb_getreg(GD32_I2C_STAT0_OFFSET) | (1 << 10));

  /* Generate STOP (end of write phase) */

  sccb_modifyreg(GD32_I2C_CTL0_OFFSET, 0, I2C_CTL0_STOP);

  /* Small delay to allow STOP condition to complete on the bus */

  for (wait_i = 0; wait_i < 100; wait_i++);

  /* ---- Phase 2: Read data (slave addr = 0x61) ---- */

  /* Generate START */

  sccb_modifyreg(GD32_I2C_CTL0_OFFSET, 0, I2C_CTL0_START);

  /* Wait for SBSEND */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_SBSEND) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB RD: SBSEND2 timeout reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Send slave read address (0x61) */

  sccb_putreg(GD32_I2C_DATA_OFFSET, SCCB_READ_ADDR);

  /* Wait for ADDSEND */

  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_ADDSEND) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB RD: ADDSEND2 timeout reg=0x%02x "
                 "STAT0=0x%04x\n", regaddr,
                 sccb_getreg(GD32_I2C_STAT0_OFFSET));
          return -ETIMEDOUT;
        }
    }

  /* Clear ADDSEND */

  (void)sccb_getreg(GD32_I2C_STAT0_OFFSET);
  (void)sccb_getreg(GD32_I2C_STAT1_OFFSET);

  /* Disable ACK (NACK after the single byte read) */

  sccb_modifyreg(GD32_I2C_CTL0_OFFSET, I2C_CTL0_ACKEN, 0);

  /* Wait for RBNE (Receive Buffer Not Empty) */

