open-vela/vendor_gigadevice/boards/gd32f4/gd32f470i_eval/src/gd32f4xx_dci_ov2640.c
  timeout = SCCB_TIMEOUT;
  while ((sccb_getreg(GD32_I2C_STAT0_OFFSET) & I2C_STAT0_RBNE) == 0)
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR, "SCCB RD: RBNE timeout reg=0x%02x\n", regaddr);
          return -ETIMEDOUT;
        }
    }

  /* Generate STOP */

  sccb_modifyreg(GD32_I2C_CTL0_OFFSET, 0, I2C_CTL0_STOP);

  /* Read the data byte */

  *regval = (uint8_t)(sccb_getreg(GD32_I2C_DATA_OFFSET) & 0xff);

  /* Clear AF flag */

  sccb_putreg(GD32_I2C_STAT0_OFFSET,
              sccb_getreg(GD32_I2C_STAT0_OFFSET) | (1 << 10));

  /* Re-enable ACK for next transaction */

  sccb_modifyreg(GD32_I2C_CTL0_OFFSET, 0, I2C_CTL0_ACKEN);

  return OK;
}

/****************************************************************************
 * Name: gd32_ov2640_putreglist
 ****************************************************************************/

static int gd32_ov2640_putreglist(FAR struct i2c_master_s *i2c,
                                  FAR const char reglist[][2],
                                  size_t nentries)
{
  size_t index;
  int ret;

  for (index = 0; index < nentries; index++)
    {
      ret = gd32_ov2640_putreg(i2c,
                               (uint8_t)reglist[index][0],
                               (uint8_t)reglist[index][1]);
      if (ret < 0)
        {
          return ret;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: gd32_ov2640_outsize_set
 ****************************************************************************/

static int gd32_ov2640_outsize_set(FAR struct i2c_master_s *i2c,
                                   uint16_t width, uint16_t height)
{
  uint16_t outw;
  uint16_t outh;
  uint8_t temp;
  int ret;

  if ((width % 4) != 0 || (height % 4) != 0)
    {
      return -EINVAL;
    }

  outw = width / 4;
  outh = height / 4;

  ret = gd32_ov2640_putreg(i2c, GD32_OV2640_REG_BANK_SEL, 0x00);
  if (ret < 0)
    {
      return ret;
    }

  ret = gd32_ov2640_putreg(i2c, GD32_OV2640_REG_CTRL0, 0x04);
  if (ret < 0)
    {
      return ret;
    }

  ret = gd32_ov2640_putreg(i2c, GD32_OV2640_REG_OUTW, outw & 0xff);
  if (ret < 0)
    {
      return ret;
    }

  ret = gd32_ov2640_putreg(i2c, GD32_OV2640_REG_OUTH, outh & 0xff);
  if (ret < 0)
    {
      return ret;
    }

  temp  = (outw >> 8) & 0x03;
  temp |= (outh >> 6) & 0x04;

  ret = gd32_ov2640_putreg(i2c, GD32_OV2640_REG_OUTSIZE, temp);
  if (ret < 0)
    {
      return ret;
    }

  return gd32_ov2640_putreg(i2c, GD32_OV2640_REG_CTRL0, 0x00);
}

/****************************************************************************
 * Name: gd32_ov2640_verify_id
 ****************************************************************************/

static int gd32_ov2640_verify_id(FAR struct i2c_master_s *i2c,
                                 FAR const char *stage)
{
  uint8_t midh;
  uint8_t midl;
  uint8_t ver;
  uint8_t pid;
  int ret;

  ret = gd32_ov2640_putreg(i2c, GD32_OV2640_REG_BANK_SEL, 0x01);
  if (ret < 0)
    {
      return ret;
    }

  ret = gd32_ov2640_getreg(i2c, 0x1c, &midh);
  if (ret < 0)
    {
      return ret;
    }

  ret = gd32_ov2640_getreg(i2c, 0x1d, &midl);
  if (ret < 0)
    {
      return ret;
    }

  ret = gd32_ov2640_getreg(i2c, 0x0b, &ver);
  if (ret < 0)
    {
      return ret;
    }

  ret = gd32_ov2640_getreg(i2c, 0x0a, &pid);
  if (ret < 0)
    {
      return ret;
    }

  syslog(LOG_INFO, "OV2640 ID[%s] MID=%02x%02x VER=%02x PID=%02x\n",
         stage, midh, midl, ver, pid);

  if (midh != GD32_OV2640_MIDH_EXPECTED ||
      midl != GD32_OV2640_MIDL_EXPECTED ||
      ver  != GD32_OV2640_VER_EXPECTED  ||
      pid  != GD32_OV2640_PID_EXPECTED)
    {
      syslog(LOG_ERR,
             "ERROR: OV2640 ID mismatch at %s, "
             "expect MID=%02x%02x VER=%02x PID=%02x\n",
             stage,
             GD32_OV2640_MIDH_EXPECTED,
             GD32_OV2640_MIDL_EXPECTED,
             GD32_OV2640_VER_EXPECTED,
             GD32_OV2640_PID_EXPECTED);
      return -ENODEV;
    }

  return OK;
}

/****************************************************************************
 * Name: gd32_ov2640_initialize
 ****************************************************************************/

static int gd32_ov2640_initialize(FAR struct ov2640_sensor_s *priv)
{
  int ret;

  if (priv->initialized)
    {
      return OK;
    }

  syslog(LOG_INFO, "OV2640: Sending software reset...\n");

  ret = gd32_ov2640_putreg(priv->i2c, GD32_OV2640_REG_BANK_SEL, 0x01);
  if (ret < 0)
    {
      syslog(LOG_ERR, "OV2640: BANK_SEL write failed: %d\n", ret);
      return ret;
    }

  ret = gd32_ov2640_putreg(priv->i2c, GD32_OV2640_REG_RESET, 0x80);
  if (ret < 0)
    {
      syslog(LOG_ERR, "OV2640: soft reset write failed: %d\n", ret);
      return ret;
    }

  up_mdelay(50);

  ret = gd32_ov2640_putreglist(priv->i2c, gd32_ov2640_svga_init_reg_tbl,
                               GD32_OV2640_NENTRIES(
                                 gd32_ov2640_svga_init_reg_tbl));
  if (ret < 0)
    {
      return ret;
    }

  up_mdelay(100);

  ret = gd32_ov2640_putreglist(priv->i2c, gd32_ov2640_rgb565_reg_tbl,
                               GD32_OV2640_NENTRIES(
                                 gd32_ov2640_rgb565_reg_tbl));
  if (ret < 0)
    {
      return ret;
    }

  up_mdelay(100);

  ret = gd32_ov2640_outsize_set(priv->i2c,
                                GD32_OV2640_SIZE_WIDTH,
                                GD32_OV2640_SIZE_HEIGHT);
  if (ret < 0)
    {
      syslog(LOG_ERR, "OV2640: outsize_set failed: %d\n", ret);
      return ret;
    }

  up_mdelay(10);

  /* Read ID after full initialization (matches vendor demo order) */

  ret = gd32_ov2640_verify_id(priv->i2c, "after-init");
  if (ret < 0)
    {
      /* Dump I2C register state for debugging */

      syslog(LOG_ERR, "OV2640: I2C0 CTL0=0x%04x CTL1=0x%04x "
             "STAT0=0x%04x STAT1=0x%04x\n",
             sccb_getreg(GD32_I2C_CTL0_OFFSET),
             sccb_getreg(GD32_I2C_CTL1_OFFSET),
             sccb_getreg(GD32_I2C_STAT0_OFFSET),
             sccb_getreg(GD32_I2C_STAT1_OFFSET));
      return ret;
    }

  priv->initialized = true;
  return OK;
}

/****************************************************************************
 * Name: gd32_ov2640_clock_enable
 *
 * Description:
 *   Provide the OV2640 XCLK from CKOUT0 on PA8, following the vendor demo.
 *
 ****************************************************************************/

