open-vela/vendor_gigadevice/boards/gd32f4/gd32f470i_eval/src/gd32f4xx_dci_ov2640.c
static void gd32_ov2640_clock_enable(void)
{
  uint32_t regval;

  gd32_gpio_config(BOARD_OV2640_MCLK_PIN);

  regval  = getreg32(GD32_RCU_CFG0);
  regval &= ~(RCU_CFG0_CKOUT0SEL_MASK | RCU_CFG0_CKOUT0DIV_MASK);
  regval |= BOARD_OV2640_MCLK_SOURCE | BOARD_OV2640_MCLK_DIVIDER;
  putreg32(regval, GD32_RCU_CFG0);

  up_mdelay(10);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_dci_setup
 *
 * Description:
 *   Initialize the DCI (Digital Camera Interface) and OV2640 camera sensor
 *   on the GD32F470IK-EVAL board. This function:
 *     1. Enables the OV2640 XCLK
 *     2. Initializes the I2C bus for OV2640 SCCB control
 *     3. Initializes the OV2640 sensor driver
 *     4. Registers the imgsensor interface
 *     5. Gets the DCI imgdata interface and registers it
 *     6. Creates the capture device at /dev/video0
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.
 *
 ****************************************************************************/

int gd32_dci_setup(void)
{
  struct imgdata_s *imgdata;
  struct i2c_master_s *i2c;
  int ret;

  /* Drive OV2640 XCLK before sensor reset and SCCB accesses. */

  gd32_ov2640_clock_enable();

  /* Initialize the I2C bus for OV2640 SCCB communication.
   * We use gd32_i2cbus_initialize to set up clocks, GPIO, and I2C speed,
   * but then disable all I2C interrupts since our SCCB implementation
   * bypasses the NuttX I2C transfer framework and uses polling.
   */

  i2c = gd32_i2cbus_initialize(BOARD_DCI_I2C_BUS);
  if (i2c == NULL)
    {
      syslog(LOG_ERR, "ERROR: Failed to initialize I2C%d for OV2640\n",
             BOARD_DCI_I2C_BUS);
      return -ENODEV;
    }

  /* Disable I2C event/error/buffer interrupts to prevent NuttX ISR from
   * interfering with our direct register-level SCCB operations.
   */

  sccb_modifyreg(GD32_I2C_CTL1_OFFSET, I2C_CTL1_INTS_MASK, 0);

  /* Enable the I2C peripheral and ACK (needed for SCCB) */

  sccb_modifyreg(GD32_I2C_CTL0_OFFSET, 0, I2C_CTL0_ACKEN);

  /* Initialize OV2640 sensor via I2C */

  g_ov2640_priv.i2c         = i2c;
  g_ov2640_priv.initialized = false;

  ret = gd32_ov2640_initialize(&g_ov2640_priv);
  if (ret < 0)
    {
      syslog(LOG_ERR,
             "ERROR: Failed to initialize OV2640 with GD32 SCCB flow: %d\n",
             ret);
      gd32_i2cbus_uninitialize(i2c);
      return ret;
    }

  /* Set up the OV2640 imgsensor interface */

  g_ov2640_priv.sensor.ops              = &g_ov2640_sensor_ops;
  g_ov2640_priv.sensor.fmtdescs_num     = OV2640_FMTDESCS_NUM;
  g_ov2640_priv.sensor.fmtdescs         = g_ov2640_fmtdescs;
  g_ov2640_priv.sensor.frmsizes_num     = OV2640_FRMSIZES_NUM;
  g_ov2640_priv.sensor.frmsizes         = g_ov2640_frmsizes;
  g_ov2640_priv.sensor.frmintervals_num = 0;
  g_ov2640_priv.sensor.frmintervals     = NULL;

  /* Register the OV2640 as an imgsensor */

  ret = imgsensor_register(&g_ov2640_priv.sensor);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: imgsensor_register failed: %d\n", ret);
      gd32_i2cbus_uninitialize(i2c);
      return ret;
    }

  /* Initialize the DCI driver and get the imgdata interface */

  imgdata = gd32_dci_initialize();
  if (imgdata == NULL)
    {
      syslog(LOG_ERR, "ERROR: Failed to initialize DCI driver\n");
      gd32_i2cbus_uninitialize(i2c);
      return -ENODEV;
    }

  /* Register the DCI as imgdata backend */

  imgdata_register(imgdata);

  /* Create the V4L2 capture device */

  ret = capture_initialize("/dev/video0");
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: capture_initialize failed: %d\n", ret);
      gd32_dci_uninitialize();
      gd32_i2cbus_uninitialize(i2c);
      return ret;
    }

  syslog(LOG_INFO, "DCI: /dev/video0 registered successfully\n");
  return OK;
}

#endif /* CONFIG_GD32F4_DCI */
